In [1]:
import pandas as pd

In [19]:
names=pd.DataFrame({"name":["sagar","kuamr","bibek","santosh","shivam","mahesh"]})
ages=pd.DataFrame({"Age":[21,22,19,25,16,30]})

In [56]:
names2=pd.DataFrame({"names2":["anil","niruta","asmi","priyanka","aman","shridhaR"]})
names2
#merge the tweo dataframe
#no of elemntd should be equals for combining the dataframe #concate
#addition in columns
df=pd.concat([names,ages],axis=1)
df

      name  Age
0    sagar   21
1    kuamr   22
2    bibek   19
3  santosh   25
4   shivam   16
5   mahesh   30

In [34]:
#addition in row vertical additon
pd.concat([names,names2],axis=0)

## pandas indexing

In [42]:
#add double bracket to acces more than 1 columns
#for one column use single bracket or double it won't effect
df[['name']]

      name
0    sagar
1    kuamr
2    bibek
3  santosh
4   shivam
5   mahesh

In [48]:
#filtering the data from dataset
#boolen value
df['Age']<18

#list of the person less than 18
df[df['Age']<18]

#for only name purpose #double bracket will give the index also
df[df['Age']<21][['name']]

     name
2   bibek
4  shivam

### pandas series and datafdrame

In [50]:
s1=pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [52]:
#adding index to the dataframe
s2=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [53]:
#Accesing by the index of the series 
s2['b']

2

## /column selection loc and Iloc

In [59]:
df.loc[0,'Age']  #[row,col] BY labels

21

In [61]:
df.iloc[2,1]  #by the index values we can Access the Integer values

19

## # Creating and Reading the dataFrame

1. Create the data and read then df.to_csv(name)

In [3]:
df=pd.DataFrame({"name":["sagar","kuamr","bibek","santosh","shivam","mahesh"],
                "age":[21,22,19,25,16,30],
                "city":['belauri',"delhi","tokyo","mumbai","KTM","DHN"]})
df

      name  age     city
0    sagar   21  belauri
1    kuamr   22    delhi
2    bibek   19    tokyo
3  santosh   25   mumbai
4   shivam   16      KTM
5   mahesh   30      DHN

In [8]:
#save the file in Csv formate 
df.to_csv("basicdata.csv",index=False) #index= False meaning ingnore the extra index col

In [16]:
# read the same data we have saved in the file csv format
data=pd.read_csv("basicdata.csv")
data

      name  age     city
0    sagar   21  belauri
1    kuamr   22    delhi
2    bibek   19    tokyo
3  santosh   25   mumbai
4   shivam   16      KTM
5   mahesh   30      DHN

### Group by function in pandas

In [4]:
df=pd.read_csv("Amazon Sales data.csv")
df.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.80,328376.44,248406.36
2,Europe,Russia,Office Supplies,Offline,L,5/2/2014,341417157,5/8/2014,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,Sub-Saharan Africa,Sao Tome and Principe,Fruits,Online,C,6/20/2014,514321792,7/5/2014,8102,9.33,6.92,75591.66,56065.84,19525.82
4,Sub-Saharan Africa,Rwanda,Office Supplies,Offline,L,2/1/2013,115456712,2/6/2013,5062,651.21,524.96,3296425.02,2657347.52,639077.50

### Date range Function

In [6]:
# format = year/month/day daya within the range provided
pd.date_range(start='2022-02-22',end='2022-03-22')

DatetimeIndex(['2022-02-22', '2022-02-23', '2022-02-24', '2022-02-25',
               '2022-02-26', '2022-02-27', '2022-02-28', '2022-03-01',
               '2022-03-02', '2022-03-03', '2022-03-04', '2022-03-05',
               '2022-03-06', '2022-03-07', '2022-03-08', '2022-03-09',
               '2022-03-10', '2022-03-11', '2022-03-12', '2022-03-13',
               '2022-03-14', '2022-03-15', '2022-03-16', '2022-03-17',
               '2022-03-18', '2022-03-19', '2022-03-20', '2022-03-21',
               '2022-03-22'],
              dtype='datetime64[ns]', freq='D')

In [7]:
#fequncy month #last mont will be excluded
pd.date_range(start='2022-02-22',end='2022-09-22',freq='m')

DatetimeIndex(['2022-02-28', '2022-03-31', '2022-04-30', '2022-05-31',
               '2022-06-30', '2022-07-31', '2022-08-31'],
              dtype='datetime64[ns]', freq='M')

In [13]:
#weeks days of the year
pd.bdate_range(start='2024-02-01',end='2024-02-25')

DatetimeIndex(['2024-02-01', '2024-02-02', '2024-02-05', '2024-02-06',
               '2024-02-07', '2024-02-08', '2024-02-09', '2024-02-12',
               '2024-02-13', '2024-02-14', '2024-02-15', '2024-02-16',
               '2024-02-19', '2024-02-20', '2024-02-21', '2024-02-22',
               '2024-02-23'],
              dtype='datetime64[ns]', freq='B')

### Pandas top commands

In [15]:
 df.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.0,1582243.5,951410.5

In [19]:
#to addd the new column to the dataset
data['dept']=['CSe','AIML','IT','CSBS',"AIDS",'CIVIL']
data

      name  age     city   dept
0    sagar   21  belauri    CSe
1    kuamr   22    delhi   AIML
2    bibek   19    tokyo     IT
3  santosh   25   mumbai   CSBS
4   shivam   16      KTM   AIDS
5   mahesh   30      DHN  CIVIL

In [21]:
#Rename of all the column names 
data.columns=['NAME','AGE','CITY','DEPT']
data

      NAME  AGE     CITY   DEPT
0    sagar   21  belauri    CSe
1    kuamr   22    delhi   AIML
2    bibek   19    tokyo     IT
3  santosh   25   mumbai   CSBS
4   shivam   16      KTM   AIDS
5   mahesh   30      DHN  CIVIL

In [26]:
#dropping of the column 
#temp purpose
data.drop(['DEPT'],axis=1)

      NAME  AGE     CITY
0    sagar   21  belauri
1    kuamr   22    delhi
2    bibek   19    tokyo
3  santosh   25   mumbai
4   shivam   16      KTM
5   mahesh   30      DHN

In [31]:
#for permanant
data.drop(['AGE'],axis=1,inplace=True)

In [32]:
data

      NAME     CITY
0    sagar  belauri
1    kuamr    delhi
2    bibek    tokyo
3  santosh   mumbai
4   shivam      KTM
5   mahesh      DHN

### Apply Method

In [35]:
data['Marks']=[124,145,177,121,134,180]

In [36]:
data

      NAME     CITY  Marks
0    sagar  belauri    124
1    kuamr    delhi    145
2    bibek    tokyo    177
3  santosh   mumbai    121
4   shivam      KTM    134
5   mahesh      DHN    180

In [41]:
#for each colun appy the function 
data['Marks']=data['Marks'].apply(lambda x:x/5)
data

      NAME     CITY     Marks
0    sagar  belauri  0.027556
1    kuamr    delhi  0.032222
2    bibek    tokyo  0.039333
3  santosh   mumbai  0.026889
4   shivam      KTM  0.029778
5   mahesh      DHN  0.040000

In [42]:
#reanme the columns in dataframe
data.rename(columns={"Marks":"Average marks"},inplace=True)

In [43]:
data

      NAME     CITY  Average marks
0    sagar  belauri       0.027556
1    kuamr    delhi       0.032222
2    bibek    tokyo       0.039333
3  santosh   mumbai       0.026889
4   shivam      KTM       0.029778
5   mahesh      DHN       0.040000

### sort index in dataframe

In [44]:
data.index=[12,5,2,6,8,3]

In [48]:
#sort the index of the dataframe in acsendin or descending order 
data.sort_index(ascending=False)  #acsc is true

       NAME     CITY  Average marks
12    sagar  belauri       0.027556
8    shivam      KTM       0.029778
6   santosh   mumbai       0.026889
5     kuamr    delhi       0.032222
3    mahesh      DHN       0.040000
2     bibek    tokyo       0.039333

In [52]:
#sorting in the terms of the numerical data
data.sort_values(by="Average marks",ascending=False)

       NAME     CITY  Average marks
3    mahesh      DHN       0.040000
2     bibek    tokyo       0.039333
5     kuamr    delhi       0.032222
8    shivam      KTM       0.029778
12    sagar  belauri       0.027556
6   santosh   mumbai       0.026889